{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 784], "activity_regularizer": null, "use_bias": true, "units": 256, "activation": "relu", "trainable": true, "name": "dense_20", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "units": 128, "activation": "relu", "trainable": true, "name": "dense_21", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "units": 128, "activation": "relu", "trainable": true, "name": "dense_22", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "units": 10, "activation": "softmax", "trainable": true, "name": "dense_23", "kernel_regularizer": null, "bias_constraint": null}}]}, "keras_version": "2.1.6-tf", "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "decay": 0.0, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "amsgrad": false, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [784, 256], "name": "dense_20/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_20/bias", "dtype": "float32"}, {"shape": [256, 128], "name": "dense_21/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_21/bias", "dtype": "float32"}, {"shape": [128, 128], "name": "dense_22/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_22/bias", "dtype": "float32"}, {"shape": [128, 10], "name": "dense_23/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_23/bias", "dtype": "float32"}]}]}