{"modelTopology": {"training_config": {"optimizer_config": {"config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "sample_weight_mode": null, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"]}, "keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"config": [{"config": {"activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [5, 5], "filters": 32, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [5, 5], "filters": 32, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_1", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_1", "data_format": "channels_last", "output_padding": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2DTranspose"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_2", "data_format": "channels_last", "output_padding": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2DTranspose"}, {"config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_2", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"rate": 0.25, "seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_3", "data_format": "channels_last", "output_padding": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [5, 5], "filters": 32, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2DTranspose"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_4", "data_format": "channels_last", "output_padding": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [5, 5], "filters": 32, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2DTranspose"}, {"config": {"activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_5", "data_format": "channels_last", "output_padding": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 1, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2DTranspose"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [5, 5, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [5, 5, 32, 32]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_3/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_4/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_transpose_1/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_transpose_1/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_transpose_2/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_transpose_2/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_transpose_3/kernel", "shape": [5, 5, 32, 64]}, {"dtype": "float32", "name": "conv2d_transpose_3/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_transpose_4/kernel", "shape": [5, 5, 32, 32]}, {"dtype": "float32", "name": "conv2d_transpose_4/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_transpose_5/kernel", "shape": [1, 1, 1, 32]}, {"dtype": "float32", "name": "conv2d_transpose_5/bias", "shape": [1]}]}]}